app/Http/Services/Blog/BlogService.php

select * from `post_categories`
---
    public function getCategoryBlog()
    {
        return PostCategory::get();

select * from `post_categories` where `post_categories`.`id` in (1, 2, 3)
select * from `posts` order by `id` desc
---
    public function get()
    {
        return Post::with('postCategory')->orderByDesc('id')->get();