app/Http/Services/Menu/MenuService.php

    public function get()
    {
        return Menu::orderbyDesc('id')->paginate(3);
---
select * from `menus` order by `id` desc limit 3 offset 0
select count(*) as aggregate from `menus`