app/Http/Services/CartService.php

    public function getTransaction()
    {
        return Transaction::orderByDesc('id')->get();
---
select * from `transactions` order by `id` desc

    public function getProductForCart($transaction)
    {
        return $transaction->carts()->with(['product' => function ($query) {
            $query->select('id', 'name', 'thumb');
        }])->get();
---
select `id`, `name`, `thumb` from `products` where `products`.`id` in (13)

    public function getProduct()
    {
        $carts = Session::get('carts');
        if (is_null($carts)) return [];

        $productId = array_keys($carts);
        return Product::select('id', 'name', 'price', 'price_sale', 'thumb')
            ->where('active', 1)
            ->whereIn('id', $productId)
            ->get();
---
select `id`, `name`, `price`, `price_sale`, `thumb` from `products` where `active` = 1 and `id` in (15, 13, 16)