app/Http/Controllers/User/AuthController.php

select * from `users` where `email` = 'trungdao10a2@gmail.com' and `users`.`deleted_at` is null limit 1
---
    protected function _registerOrLoginUser($data)
    {
        $user = User::where('email', '=', $data->email)->first();