app/Http/Controllers/User/BlogController.php

select * from `post_categories` where `post_categories`.`id` in (2)
select * from `posts` where `id` = '3' and `active` = 1 limit 1
update `posts` set `view` = 1016, `posts`.`updated_at` = '2024-03-31 23:42:13' where `id` = 3
select * from `posts` where `active` = 1
select count(*) as aggregate from `post_comments` where `post_id` = '3' and `active` = 1
select * from `post_comments` where `post_id` = '3' and `active` = 1 order by `id` desc limit 7
---
    public function detail($id = '', $slug = '')
    {
        $comment_number = 7;
        $blog = Post::where('id', $id)
                ->where('active', 1)
                ->with('postCategory')
                ->firstOrFail();
        $blog->view = $blog->view + 1;
        $blog->save();
        $blognew = Post::where('active', 1)->get();
        $countComment = PostComment::where('post_id', $id)->where('active', 1)->count();
        $list_comment = PostComment::where('post_id',$id)->orderby('id', 'DESC')->take($comment_number)->get();

select * from `posts` where `active` = 1 and `name` LIKE '%d%'
---
    public function searchAjax(Request $request)
    {
        $data = $request->all();
        if ($data['keywords']) {
            $searchs = Post::where('active', 1)->where('name', 'LIKE', '%' . $data['keywords'] . '%')->get();

select * from `post_categories` where `post_categories`.`id` in (2)
select * from `posts` where `id` = '3' and `active` = 1 limit 1
select * from `post_comments` where `post_id` = '3' and `active` = 1 order by `id` desc
---
    public function latest_comment(Request $request)
    {
        $post_id = $request->blog_id;
        $blog = Post::where('id', $post_id)
                ->where('active', 1)
                ->with('postCategory')
                ->firstOrFail();
        $comments = PostComment::where('post_id', $post_id)->orderBy('id', 'DESC')->get();

select * from `post_categories` where `post_categories`.`id` in (2)
select * from `posts` where `id` = '3' and `active` = 1 limit 1
select * from `post_comments` where `post_id` = '3' order by `number_like` desc
---
    public function popular_comment(Request $request)
    {
        $post_id = $request->blog_id;
        $blog = Post::where('id', $post_id)
                ->where('active', 1)
                ->with('postCategory')
                ->firstOrFail();
        $comments = PostComment::where('post_id', $post_id)->orderBy('number_like', 'DESC')->get();

select * from `post_categories` where `post_categories`.`id` in (1)
select * from `posts` where `id` = '4' and `active` = 1 limit 1
---
    public function add_reply(Request $request)
    {
        $post_id = $request->post_id;
        $comment_id = $request->comment_id;
        $validation = Validator::make($request->all(), [
            'content' => 'required',
        ], [
            'content.required' => 'Vui lòng nhập nội dung trả lời!'
        ]);
        if ($validation->fails()) {
            return response()->json(['error' => $validation->errors()->first()]);
        }
        else {
            $reply = new PostCommentReply();
            $reply->user_id =  Auth::id();
            $reply->comment_id = $comment_id;
            $reply->content = $request->content;
            $reply->active = 1;
            $reply->save();
        }
        $blog = Post::where('id', $post_id)
                ->where('active', 1)
                ->with('postCategory')
                ->firstOrFail();

select * from `post_comments` where `post_comments`.`id` = '76' limit 1
insert into `comment_user` (`comment_id`, `created_at`, `updated_at`, `user_id`) values ('76', '2024-03-21 17:07:03', '2024-03-21 17:07:03', 1)
update `post_comments` set `number_like` = 3, `post_comments`.`updated_at` = '2024-03-21 17:07:03' where `id` = 76
delete from `comment_user` where `comment_user`.`user_id` = 1 and `comment_user`.`comment_id` in ('79')
update `post_comments` set `number_like` = 2, `post_comments`.`updated_at` = '2024-03-21 17:29:29' where `id` = 79
---
    public function postCommentLike(Request $request)
    {
        $id = $request->id_comment;
        $user = Auth::user();
        $comment = PostComment::find($id);

        $likeComment = $user->likedComments()->where('comment_id', $id)->count();
        if ($likeComment == 0) {
            $user->likedComments()->attach($id);
            $comment->number_like +=  1;
            $comment->save();
        } else {
            $user->likedComments()->detach($id);
            $comment->number_like -=  1;
            $comment->save();

update `post_comments` set `number_like` = 1, `post_comments`.`updated_at` = '2024-03-24 22:11:03' where `id` = 101
---
    public function postReplyLike(Request $request)
    {
            $id = $request->id_reply;
            $user = Auth::user();
            $reply = PostCommentReply::find($id);

            $likeReply = $user->likedReplies()->where('reply_id', $id)->count();

            if ($likeReply == 0) {
                $user->likedReplies()->attach($id);
                $reply->number_like +=  1;
                $reply->save();