app/Http/Controllers/User/BlogController.php

    public function comment_hidden(Request $request)
    {
        $comment_id = $request->id_comment;
        $post_id = $request->post_id;
        $comment = PostComment::find($comment_id);

        if ($comment) {
            $comment->active = 0;
            $comment->save();
        } else {
            return response()->json([
                'error' => 'Ẩn bình luận thất bại!',
            ]);
        }

        $blog = Post::where('id', $post_id)
            ->where('active', 1)
            ->with('postCategory')
            ->firstOrFail();
        $comments =  PostComment::where('post_id',$post_id)->where('active', 1)->orderby('id', 'DESC')->get();
---
select * from `post_comments` where `post_id` = '4' and `active` = 1 order by `id` desc

    public function add_comment(Request $request)
    {
        $post_id = $request->post_id;
        $validation = Validator::make($request->all(), [
            'content' => 'required',
        ], [
            'content.required' => 'Vui lòng nhập nội dung bình luận'
        ]);
        if ($validation->fails()) {
            return response()->json(['error' => $validation->errors()->first()]);
        }
        else {
            $comment = new PostComment();
            $comment->user_id =  Auth::id();
            $comment->post_id = $request->post_id;
            $comment->content = $request->content;
            $comment->reply_id =  $request->reply_id ? $request->reply_id : 0;
            $comment->active = 1;
            $comment->save();
        }

        $blog = Post::where('id', $post_id)
                ->where('active', 1)
                ->with('postCategory')
                ->firstOrFail();
        $comments =  PostComment::where('post_id',$post_id)->where('active', 1)->orderby('id', 'DESC')->get();
---
select * from `post_categories` where `post_categories`.`id` in (1)
select * from `posts` where `id` = '4' and `active` = 1 limit 1
select * from `post_comments` where `post_id` = '4' and `active` = 1 order by `id` desc