app/Http/Controllers/User/BlogController.php

select * from `posts` order by `id` desc limit 3
---
    public function detail($id = '', $slug = '')
    {
        $blog = Post::where('id', $id)
                ->where('active', 1)
                ->with('postCategory')
                ->firstOrFail();
        #Increase views
        $blog->view = $blog->view + 1;
        $blog->save();

        $blognew = Post::OrderBy('id', 'desc')->limit('3')->get();

select * from `post_comments` where `post_id` = '3' order by `id` desc limit 4
---
    public function load_Comment(Request $request)
    {
        $data = $request->all();
        $comment_number = 4;

        if($data['id'] > 0) {
            $list_comment = PostComment::where('post_id', $data['post_id'])->where('id', '<', $data['id'])->orderby('id', 'DESC')->take($comment_number)->get();
        } else {
            $list_comment = PostComment::where('post_id', $data['post_id'])->orderby('id', 'DESC')->take($comment_number)->get();

select * from `post_comment_replies` where `comment_id` = '90' and `id` < '90' order by `id` desc limit 4
---
    public function load_Reply(Request $request)
    {
        $id = $request->comment_id;
        $reply_number = 4;

        if ($id > 0) {
            $list_reply = PostCommentReply::where('comment_id', $id)->where('id', '<', $id)->orderby('id', 'DESC')->take($reply_number)->get();
        } else {
            $list_reply = PostCommentReply::where('comment_id', $id)->orderby('id', 'DESC')->take($reply_number)->get();

insert into `post_comments` (`user_id`, `post_id`, `content`, `active`, `updated_at`, `created_at`) values (1, '7', 'dsadsa', 1, '2024-03-15 13:46:03', '2024-03-15 13:46:03')
---
    public function postComment($post_id, BlogRequest $request)
    {
        $validation = Validator::make($request->all(), [
            'content' => 'required',
        ], [
            'content.required' => 'Vui lòng nhập nội dung bình luận'
        ]);

        if ($validation->fails()) {
            return response()->json(['error' => $validation->errors()->first()]);
        } else {
            $user_id = Auth::id();
            $data = [
                'user_id' => $user_id,
                'post_id' => $post_id,
                'content' => $request->content,
                'active' => 1,
                // 'reply_id' => $request->reply_id ? $request->reply_id : 0,
            ];

            $comment = PostComment::create($data);