app/Http/Controllers/User/CartController.php

select count(*) as aggregate from `coupons`
select * from `coupons` where `code` = 'TRUNGDZ' and `status` = 1 and `date_end` >= '2024/03/28' limit 1
---
    public function check_coupon(Request $request)
    {
        $today = Carbon::now('Asia/Ho_Chi_Minh')->format('Y/m/d');
        $validator = Validator::make($request->all(), [
            'coupon_input' => 'required',
        ]);

        if ($validator->fails()) {
            return response()->json(['errors' => $validator->errors()]);
        } else {
            $coupon_input = $request->coupon_input;
            $coupon = Coupon::where('code', $coupon_input)
                ->where('status', 1)
                ->where('date_end', '>=', $today)
                ->first();

            if ($coupon) {
                $count_coupon = $coupon->count();
                if ($count_coupon > 0) {
                    $coupon_session = Session::get('coupon');