app/Http/Controllers/User/HomeController.php

select * from `sliders` where `active` = 1 order by `sort_by` asc
select `name`, `link`, `thumb`, `description` from `menus` order by `id` desc
select * from `posts` where `active` = 1 order by `id` desc limit 3
select `thumb`, `linkYT`, `description` from `aboutus` limit 1
select min(`price_sale`) as aggregate from `products`
select * from `products` where `cat_id` = 7 limit 4
select * from `products` where `cat_id` = 5 limit 4
---
    public function index()
    {
        $slider = Slider::where('active', 1)->orderBy('sort_by')->get();
        $menu = Menu::select('name', 'link', 'thumb', 'description')->orderbyDesc('id')->get();
        $posts = Post::where('active', 1)->OrderBy('id', 'desc')->limit('3')->get();
        $abouthome = Aboutus::select('thumb', 'linkYT', 'description')->firstOrFail();
        $minprice = Product::min('price_sale');
        $cat1Product = Product::where('cat_id', 7)->limit(4)->get();
        $cat2Product = Product::where('cat_id', 5)->limit(4)->get();

select * from `products` order by `id` desc limit 4
---
    public function latest_product(Request $request)
    {
        $data = $request->all();
        $product_number = 4;
        if ($data['id'] > 0) {
            $list_product = Product::where('id', '<', $data['id'])->orderby('id', 'DESC')->take($product_number)->get();
        } else {
            $list_product = Product::orderby('id', 'DESC')->take($product_number)->get();