app/Http/Controllers/User/ProductController.php

select `id`, `name`, `price`, `price_sale`, `thumb` from `products` where `active` = 1 and `id` in (16)
---
    public function getProduct()
    {
        $carts = Session::get('carts');
        if (is_null($carts)) return [];

        $productId = array_keys($carts);
        return Product::select('id', 'name', 'price', 'price_sale', 'thumb')
                        ->where('active', 1)
                        ->whereIn('id', $productId)
                        ->get();

select * from `productcategories` where `active` = 1
select * from `products` where `active` = 1 limit 8 offset 0
select count(*) as aggregate from `products` where `active` = 1
---
    public function index(Request $request)
    {
        $categories = ProductCategory::where('active', 1)->get();
        $products = Product::where('active', 1)->paginate(8);

select * from `product_comments` where `product_id` = '15'
---
    public function details($id = '', $slug = '')
    {
        $product = $this->productService->showdetail($id);
        // $productsMore = $this->productService->more($id);
        $cmts = $this->productService->showRating();
        $productcmt = ProductComment::where('product_id', '=', $id)->get();