app/Http/Controllers/User/ReservationController.php

    public function index()
    {
        $aboutus = Aboutus::all();
---
select * from `aboutus`