app/Http/Controllers/User/UserController.php

     public function index(){
        $title            = 'Thông tin người dùng';
        $GetTransaction   = Transaction::where('user_id', Auth::User()->id);
        $ListTransactions = $GetTransaction->paginate(8);
        $totalTransaction = $GetTransaction
                            ->select('id')
                            ->count();
        $totalDone        = $GetTransaction
                            ->where('status', Transaction::STATUS_DONE)
                            ->select('id')
                            ->count();

        $totalDevliver    = $GetTransaction
                            ->where('status', Transaction::STATUS_DEVLIVERING)
                            ->select('id')->count();

        $listComments = ProductComment::where('email', Auth::User()->email)->paginate(8);
---
select count(*) as aggregate from `transactions` where `user_id` = 104
select count(*) as aggregate from `transactions` where `user_id` = 104 and `status` = 'DONE'
select count(*) as aggregate from `transactions` where `user_id` = 104 and `status` = 'DONE' and `status` = 'DELIVERING'
select count(*) as aggregate from `product_comments` where `email` = 'trungdao10a2@gmail.com'

    public function updateInfor(Request $request, User $user)
    {
        $result = $this->userSevice->update($request, $user);
---
update `users` set `name` = 'Đào Nhạta', `street` = '77 a', `users`.`updated_at` = '2024-03-31 21:38:29' where `id` = 104

    public function updatePassword(RequestPassword $requestPassword, User $user)
    {
        // dd($requestPassword->all());
        if (Hash::check($requestPassword->password_old, Auth::user()->password)) {
            $user = User::find( Auth::user()->id);
---
select * from `users` where `users`.`id` in (106, 'https://lh3.googleusercontent.com/a/ACg8ocIkp0fgfjxmjCWgqXKtVkUsA9hENHMuNZ2STZMriL-_TQ=s96-c', 'Trung', 'trungdao9a1@gmail.com', 0, '115292083823971469557', '115292083823971469557', '', '2024-03-30T16:09:56.000000Z', '2024-03-30T16:09:56.000000Z', '', '', '', '', '', '', '') and `users`.`deleted_at` is null