app/Http/Services/Product/AdminService.php

select * from `productcategories` where `productcategories`.`id` in (5, 7, 11, 12)
select * from `products` order by `id` desc limit 8 offset 0
select count(*) as aggregate from `products`
---
    public function get()
    {
        return Product::with('productcategory')
            ->orderByDesc('id')->paginate(8);

select * from `productcategories` order by `id` desc
---
    public function getCategory()
    {
        return ProductCategory::orderByDesc('id')->get();