app/Http/Services/Product/ProductService.php

select * from `products` where `id` = 'them' and `active` = 1 limit 1
---
    public function showdetail($id)
    {
        return Product::where('id', $id)
            ->where('active', 1)
            ->with('productCategory')
            ->firstOrFail();