app/Http/Services/Product/UserService.php

    public function showRating()
    {
        $id = ProductComment::select('id');
        return ProductComment::whereIn('product_id', $id)->get();
---
select * from `product_comments` where `product_id` in (select `id` from `product_comments`)

    public function showdetail($id)
    {
        return Product::where('id', $id)
            ->where('active', 1)
            ->with('productCategory')
            ->firstOrFail();
---
select * from `productcategories` where `productcategories`.`id` in (5)
select * from `products` where `id` = '15' and `active` = 1 limit 1

    public function relatedProduct($id)
    {
        $product = Product::where('id', $id)
        ->where('active', 1)
        ->with('productCategory')
        ->firstOrFail();
        return Product::where('cat_id', $product->cat_id)->limit(4)->whereNotIn('id', [$id])->get();
---
select * from `productcategories` where `productcategories`.`id` in (5)
select * from `products` where `id` = '15' and `active` = 1 limit 1
select * from `products` where `cat_id` = 5 and `id` not in ('15') limit 4