app/Http/Services/Counpon/CouponService.php

select * from `coupons`
---
    public function get()
    {
        return Coupon::get();