app/Http/Services/ProductCategory/ProductCategoryService.php

select * from `productcategories` order by `id` desc
---
    public function get()
    {
        return ProductCategory::orderbyDesc('id')->get();