app/Http/Services/About/AboutService.php

    public function get()
    {
        return Aboutus::select('id', 'description', 'address', 'email', 'phone', 'openH', 'thumb', 'map')->get();
---
select `id`, `description`, `address`, `email`, `phone`, `openH`, `thumb`, `map` from `aboutus`