app/Http/Services/Gallery/GalleryService.php

select * from `galleries` order by `id` desc
---
    public function get()
    {
        return Gallery::orderByDesc('id')->paginate(8);