app/Http/Services/User/UserService.php

select * from `users` where `users`.`deleted_at` is null order by `id` desc
---
    public function get() {
        return User::orderByDesc('id')->paginate(10);