app/Providers/AppServiceProvider.php

select * from `aboutus`
select `id`, `name`, `price`, `price_sale`, `thumb` from `products` where `active` = 1 and `id` in (13, 16)
---
    public function boot()
    {

        view()->composer('*', function($view){
            $carts = Session::get('carts');
            if (is_null($carts)) return [];

            $productId = array_keys($carts);
            $view->with([
              'aboutus' => Aboutus::all(),

             'productss'=> Product::select('id', 'name', 'price', 'price_sale', 'thumb')
             ->where('active', 1)
             ->whereIn('id', $productId)
             ->get(),
            ]);
        });