app/Http/Controllers/Admin/HomeController.php

select count(*) as aggregate from `products`
select count(*) as aggregate from `carts`
select count(*) as aggregate from `posts`
select count(*) as aggregate from `users` where `users`.`deleted_at` is null
select * from `contacts` order by `id` desc limit 5 offset 0
select count(*) as aggregate from `contacts`
select * from `reservations` order by `id` desc limit 5 offset 0
select count(*) as aggregate from `reservations`
select * from `transactions` order by `id` desc limit 5 offset 0
select count(*) as aggregate from `transactions`
---
    public function index()
    {
        $product_count = Product::count();
        $order_count = Cart::count();
        $post_count = Post::count();
        $acc_count = User::count();
        $title = 'Trang chủ quản trị';
        $contactNew = Contact::orderByDesc('id')->paginate(5);
        $reservationNew = Reservation::orderByDesc('id')->paginate(5);
        $orderNew = Transaction::orderByDesc('id')->paginate(5);