app/Http/Controllers/Admin/PermissionController.php

select * from `permission_categories` order by `id` desc
---
    public function show_permissionCat()
    {
        return response()->json([
            'ListPermissionCats'=> PermissionCategory::orderByDesc('id')->get(),
        ]);

select * from `permission_categories` where `parent_id` = '0'
---
    public function show_function()
    {
        return response()->json([
            'functions'=> PermissionCategory::where('parent_id', '0')->get(),
        ]);