app/Http/Controllers/Admin/UserController.php

    public function index()
    {
        $roles = Role::all();
---
select * from `roles`